
#### Directory: 'azure-dev-infra'
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success` (2)            

<details><summary>Show Plan</summary>

```diff

[command]/home/runner/work/_temp/e59787e8-9d7c-4ab3-9d18-b7ea7404e18e/terraform-bin show -no-color plan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_storage_account_sas.jagadishrunbookstfstate will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_sas" "jagadishrunbookstfstate" {
+       connection_string = (sensitive value)
+       expiry            = "2023-12-31T00:00:00Z"
+       https_only        = true
+       id                = (known after apply)
+       sas               = (sensitive value)
+       signed_version    = "2017-07-29"
+       start             = "2022-08-28T00:00:00Z"

+       permissions {
+           add     = true
+           create  = true
+           delete  = false
+           filter  = false
+           list    = false
+           process = false
+           read    = true
+           tag     = false
+           update  = false
+           write   = true
        }

+       resource_types {
+           container = false
+           object    = false
+           service   = true
        }

+       services {
+           blob  = true
+           file  = false
+           queue = false
+           table = false
        }
    }

  # azuread_application.gh-actions-runbooks-ad will be created
+   resource "azuread_application" "gh-actions-runbooks-ad" {
+       app_role_ids                = (known after apply)
+       application_id              = (known after apply)
+       disabled_by_microsoft       = (known after apply)
+       display_name                = "gh-actions-runbooks-ad"
+       id                          = (known after apply)
+       logo_url                    = (known after apply)
+       oauth2_permission_scope_ids = (known after apply)
+       object_id                   = (known after apply)
+       owners                      = [
+           "0173bcb9-cc16-4636-aae5-54aa7fb096f0",
        ]
+       prevent_duplicate_names     = false
+       publisher_domain            = (known after apply)
+       sign_in_audience            = "AzureADMyOrg"
+       tags                        = (known after apply)
+       template_id                 = (known after apply)

+       api {
+           mapped_claims_enabled          = true
+           requested_access_token_version = 2

+           oauth2_permission_scope {
+               admin_consent_description  = "Allow the application to access GH Actions on behalf of the signed-in user."
+               admin_consent_display_name = "Access GH Actions"
+               enabled                    = true
+               id                         = (known after apply)
+               type                       = "User"
+               user_consent_description   = "Allow the application to access GH Actions on your behalf."
+               user_consent_display_name  = "Access GH Actions"
+               value                      = "user_impersonation"
            }
        }

+       required_resource_access {
+           resource_app_id = "00000003-0000-0000-c000-000000000000"

+           resource_access {
+               id   = "df021288-bdef-4463-88db-98f22de89214"
+               type = "Role"
            }
+           resource_access {
+               id   = "5b567255-7703-4780-807c-7be8301ae99b"
+               type = "Role"
            }
+           resource_access {
+               id   = "dbb9058a-0e50-45d7-ae91-66909b5d4664"
+               type = "Role"
            }
+           resource_access {
+               id   = "9a5d68dd-52b0-4cc2-bd40-abcf44ac3a30"
+               type = "Role"
            }
+           resource_access {
+               id   = "19dbc75e-c2e2-444c-a770-ec69d8559fc7"
+               type = "Role"
            }
+           resource_access {
+               id   = "246dd0d5-5bd0-4def-940b-0421030a5b68"
+               type = "Role"
            }
+           resource_access {
+               id   = "01c0a623-fc9b-48e9-b794-0756f8e8f067"
+               type = "Role"
            }
        }

+       web {
+           implicit_grant {
+               access_token_issuance_enabled = false
+               id_token_issuance_enabled     = true
            }
        }
    }

  # azuread_service_principal.gh-actions-runbooks-ad will be created
+   resource "azuread_service_principal" "gh-actions-runbooks-ad" {
+       account_enabled             = true
+       app_role_ids                = (known after apply)
+       app_roles                   = (known after apply)
+       application_id              = (known after apply)
+       application_tenant_id       = (known after apply)
+       display_name                = (known after apply)
+       homepage_url                = (known after apply)
+       id                          = (known after apply)
+       logout_url                  = (known after apply)
+       oauth2_permission_scope_ids = (known after apply)
+       oauth2_permission_scopes    = (known after apply)
+       object_id                   = (known after apply)
+       redirect_uris               = (known after apply)
+       saml_metadata_url           = (known after apply)
+       service_principal_names     = (known after apply)
+       sign_in_audience            = (known after apply)
+       tags                        = (known after apply)
+       type                        = (known after apply)
    }

  # azuread_service_principal_password.gh-actions-runbooks-ad will be created
+   resource "azuread_service_principal_password" "gh-actions-runbooks-ad" {
+       display_name         = (known after apply)
+       end_date             = (known after apply)
+       id                   = (known after apply)
+       key_id               = (known after apply)
+       service_principal_id = (known after apply)
+       start_date           = (known after apply)
+       value                = (sensitive value)
    }

  # azurerm_resource_group.eastus-jagadishtf will be created
+   resource "azurerm_resource_group" "eastus-jagadishtf" {
+       id       = (known after apply)
+       location = "eastus"
+       name     = "eastus-jagadishtf"
    }

  # azurerm_role_assignment.Custom_storage_tfstate_role will be created
+   resource "azurerm_role_assignment" "Custom_storage_tfstate_role" {
+       description                      = "Custom storage role for managing tf state blob"
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = (known after apply)
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = (known after apply)
+       scope                            = "/subscriptions/0a9f0f70-125d-472b-9608-1dc91377b039/resourceGroups/eastus-jagadishtf/providers/Microsoft.Storage/storageAccounts/jagadishrunbookstfstate"
+       skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.gh-actions-runbooks-ad-reader will be created
+   resource "azurerm_role_assignment" "gh-actions-runbooks-ad-reader" {
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = (known after apply)
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "Reader"
+       scope                            = "/subscriptions/0a9f0f70-125d-472b-9608-1dc91377b039"
+       skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_definition.Custom_storage_tfstate_role_def will be created
+   resource "azurerm_role_definition" "Custom_storage_tfstate_role_def" {
+       assignable_scopes           = (known after apply)
+       description                 = "Custom storage role definition"
+       id                          = (known after apply)
+       name                        = "CustomStoragetfStateRole"
+       role_definition_id          = (known after apply)
+       role_definition_resource_id = (known after apply)
+       scope                       = "/subscriptions/0a9f0f70-125d-472b-9608-1dc91377b039/resourceGroups/eastus-jagadishtf/providers/Microsoft.Storage/storageAccounts/jagadishrunbookstfstate"

+       permissions {
+           actions     = [
+               "Microsoft.Storage/storageAccounts/listKeys/action",
+               "Microsoft.Storage/storageAccounts/regeneratekey/action",
+               "Microsoft.Storage/storageAccounts/blobServices/generateUserDelegationKey/action",
            ]
+           not_actions = []
        }
    }

  # azurerm_storage_account.jagadishrunbookstfstate will be created
+   resource "azurerm_storage_account" "jagadishrunbookstfstate" {
+       access_tier                       = (known after apply)
+       account_kind                      = "StorageV2"
+       account_replication_type          = "LRS"
+       account_tier                      = "Standard"
+       allow_nested_items_to_be_public   = false
+       cross_tenant_replication_enabled  = true
+       default_to_oauth_authentication   = false
+       enable_https_traffic_only         = true
+       id                                = (known after apply)
+       infrastructure_encryption_enabled = false
+       is_hns_enabled                    = false
+       large_file_share_enabled          = (known after apply)
+       location                          = "eastus"
+       min_tls_version                   = "TLS1_2"
+       name                              = "jagadishrunbookstfstate"
+       nfsv3_enabled                     = false
+       primary_access_key                = (sensitive value)
+       primary_blob_connection_string    = (sensitive value)
+       primary_blob_endpoint             = (known after apply)
+       primary_blob_host                 = (known after apply)
+       primary_connection_string         = (sensitive value)
+       primary_dfs_endpoint              = (known after apply)
+       primary_dfs_host                  = (known after apply)
+       primary_file_endpoint             = (known after apply)
+       primary_file_host                 = (known after apply)
+       primary_location                  = (known after apply)
+       primary_queue_endpoint            = (known after apply)
+       primary_queue_host                = (known after apply)
+       primary_table_endpoint            = (known after apply)
+       primary_table_host                = (known after apply)
+       primary_web_endpoint              = (known after apply)
+       primary_web_host                  = (known after apply)
+       public_network_access_enabled     = true
+       queue_encryption_key_type         = "Service"
+       resource_group_name               = "eastus-jagadishtf"
+       secondary_access_key              = (sensitive value)
+       secondary_blob_connection_string  = (sensitive value)
+       secondary_blob_endpoint           = (known after apply)
+       secondary_blob_host               = (known after apply)
+       secondary_connection_string       = (sensitive value)
+       secondary_dfs_endpoint            = (known after apply)
+       secondary_dfs_host                = (known after apply)
+       secondary_file_endpoint           = (known after apply)
+       secondary_file_host               = (known after apply)
+       secondary_location                = (known after apply)
+       secondary_queue_endpoint          = (known after apply)
+       secondary_queue_host              = (known after apply)
+       secondary_table_endpoint          = (known after apply)
+       secondary_table_host              = (known after apply)
+       secondary_web_endpoint            = (known after apply)
+       secondary_web_host                = (known after apply)
+       sftp_enabled                      = false
+       shared_access_key_enabled         = true
+       table_encryption_key_type         = "Service"
+       tags                              = {
+           "environment" = "dev"
        }
    }

  # azurerm_storage_container.jagadishrunbookstf will be created
+   resource "azurerm_storage_container" "jagadishrunbookstf" {
+       container_access_type   = "blob"
+       has_immutability_policy = (known after apply)
+       has_legal_hold          = (known after apply)
+       id                      = (known after apply)
+       metadata                = (known after apply)
+       name                    = "jagadishrunbookstf"
+       resource_manager_id     = (known after apply)
+       storage_account_name    = "jagadishrunbookstfstate"
    }

  # random_uuid.gh-actions-runbooks-id will be created
+   resource "random_uuid" "gh-actions-runbooks-id" {
+       id     = (known after apply)
+       result = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   app_id               = (known after apply)
+   auth_client_secret   = (sensitive value)
+   sas_url_query_string = (sensitive value)
+   sub_id               = "0a9f0f70-125d-472b-9608-1dc91377b039"
+   tenant_id            = "51cb18b8-659b-4921-a8f8-5299e1fa51ed"
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # data.azurerm_storage_account_sas.jagadishrunbookstfstate will be read during apply%0A  # (config refers to values not yet known)%0A <= data "azurerm_storage_account_sas" "jagadishrunbookstfstate" {%0A      + connection_string = (sensitive value)%0A      + expiry            = "2023-12-31T00:00:00Z"%0A      + https_only        = true%0A      + id                = (known after apply)%0A      + sas               = (sensitive value)%0A      + signed_version    = "2017-07-29"%0A      + start             = "2022-08-28T00:00:00Z"%0A%0A      + permissions {%0A          + add     = true%0A          + create  = true%0A          + delete  = false%0A          + filter  = false%0A          + list    = false%0A          + process = false%0A          + read    = true%0A          + tag     = false%0A          + update  = false%0A          + write   = true%0A        }%0A%0A      + resource_types {%0A          + container = false%0A          + object    = false%0A          + service   = true%0A        }%0A%0A      + services {%0A          + blob  = true%0A          + file  = false%0A          + queue = false%0A          + table = false%0A        }%0A    }%0A%0A  # azuread_application.gh-actions-runbooks-ad will be created%0A  + resource "azuread_application" "gh-actions-runbooks-ad" {%0A      + app_role_ids                = (known after apply)%0A      + application_id              = (known after apply)%0A      + disabled_by_microsoft       = (known after apply)%0A      + display_name                = "gh-actions-runbooks-ad"%0A      + id                          = (known after apply)%0A      + logo_url                    = (known after apply)%0A      + oauth2_permission_scope_ids = (known after apply)%0A      + object_id                   = (known after apply)%0A      + owners                      = [%0A          + "0173bcb9-cc16-4636-aae5-54aa7fb096f0",%0A        ]%0A      + prevent_duplicate_names     = false%0A      + publisher_domain            = (known after apply)%0A      + sign_in_audience            = "AzureADMyOrg"%0A      + tags                        = (known after apply)%0A      + template_id                 = (known after apply)%0A%0A      + api {%0A          + mapped_claims_enabled          = true%0A          + requested_access_token_version = 2%0A%0A          + oauth2_permission_scope {%0A              + admin_consent_description  = "Allow the application to access GH Actions on behalf of the signed-in user."%0A              + admin_consent_display_name = "Access GH Actions"%0A              + enabled                    = true%0A              + id                         = (known after apply)%0A              + type                       = "User"%0A              + user_consent_description   = "Allow the application to access GH Actions on your behalf."%0A              + user_consent_display_name  = "Access GH Actions"%0A              + value                      = "user_impersonation"%0A            }%0A        }%0A%0A      + required_resource_access {%0A          + resource_app_id = "00000003-0000-0000-c000-000000000000"%0A%0A          + resource_access {%0A              + id   = "df021288-bdef-4463-88db-98f22de89214"%0A              + type = "Role"%0A            }%0A          + resource_access {%0A              + id   = "5b567255-7703-4780-807c-7be8301ae99b"%0A              + type = "Role"%0A            }%0A          + resource_access {%0A              + id   = "dbb9058a-0e50-45d7-ae91-66909b5d4664"%0A              + type = "Role"%0A            }%0A          + resource_access {%0A              + id   = "9a5d68dd-52b0-4cc2-bd40-abcf44ac3a30"%0A              + type = "Role"%0A            }%0A          + resource_access {%0A              + id   = "19dbc75e-c2e2-444c-a770-ec69d8559fc7"%0A              + type = "Role"%0A            }%0A          + resource_access {%0A              + id   = "246dd0d5-5bd0-4def-940b-0421030a5b68"%0A              + type = "Role"%0A            }%0A          + resource_access {%0A              + id   = "01c0a623-fc9b-48e9-b794-0756f8e8f067"%0A              + type = "Role"%0A            }%0A        }%0A%0A      + web {%0A          + implicit_grant {%0A              + access_token_issuance_enabled = false%0A              + id_token_issuance_enabled     = true%0A            }%0A        }%0A    }%0A%0A  # azuread_service_principal.gh-actions-runbooks-ad will be created%0A  + resource "azuread_service_principal" "gh-actions-runbooks-ad" {%0A      + account_enabled             = true%0A      + app_role_ids                = (known after apply)%0A      + app_roles                   = (known after apply)%0A      + application_id              = (known after apply)%0A      + application_tenant_id       = (known after apply)%0A      + display_name                = (known after apply)%0A      + homepage_url                = (known after apply)%0A      + id                          = (known after apply)%0A      + logout_url                  = (known after apply)%0A      + oauth2_permission_scope_ids = (known after apply)%0A      + oauth2_permission_scopes    = (known after apply)%0A      + object_id                   = (known after apply)%0A      + redirect_uris               = (known after apply)%0A      + saml_metadata_url           = (known after apply)%0A      + service_principal_names     = (known after apply)%0A      + sign_in_audience            = (known after apply)%0A      + tags                        = (known after apply)%0A      + type                        = (known after apply)%0A    }%0A%0A  # azuread_service_principal_password.gh-actions-runbooks-ad will be created%0A  + resource "azuread_service_principal_password" "gh-actions-runbooks-ad" {%0A      + display_name         = (known after apply)%0A      + end_date             = (known after apply)%0A      + id                   = (known after apply)%0A      + key_id               = (known after apply)%0A      + service_principal_id = (known after apply)%0A      + start_date           = (known after apply)%0A      + value                = (sensitive value)%0A    }%0A%0A  # azurerm_resource_group.eastus-jagadishtf will be created%0A  + resource "azurerm_resource_group" "eastus-jagadishtf" {%0A      + id       = (known after apply)%0A      + location = "eastus"%0A      + name     = "eastus-jagadishtf"%0A    }%0A%0A  # azurerm_role_assignment.Custom_storage_tfstate_role will be created%0A  + resource "azurerm_role_assignment" "Custom_storage_tfstate_role" {%0A      + description                      = "Custom storage role for managing tf state blob"%0A      + id                               = (known after apply)%0A      + name                             = (known after apply)%0A      + principal_id                     = (known after apply)%0A      + principal_type                   = (known after apply)%0A      + role_definition_id               = (known after apply)%0A      + role_definition_name             = (known after apply)%0A      + scope                            = "/subscriptions/0a9f0f70-125d-472b-9608-1dc91377b039/resourceGroups/eastus-jagadishtf/providers/Microsoft.Storage/storageAccounts/jagadishrunbookstfstate"%0A      + skip_service_principal_aad_check = (known after apply)%0A    }%0A%0A  # azurerm_role_assignment.gh-actions-runbooks-ad-reader will be created%0A  + resource "azurerm_role_assignment" "gh-actions-runbooks-ad-reader" {%0A      + id                               = (known after apply)%0A      + name                             = (known after apply)%0A      + principal_id                     = (known after apply)%0A      + principal_type                   = (known after apply)%0A      + role_definition_id               = (known after apply)%0A      + role_definition_name             = "Reader"%0A      + scope                            = "/subscriptions/0a9f0f70-125d-472b-9608-1dc91377b039"%0A      + skip_service_principal_aad_check = (known after apply)%0A    }%0A%0A  # azurerm_role_definition.Custom_storage_tfstate_role_def will be created%0A  + resource "azurerm_role_definition" "Custom_storage_tfstate_role_def" {%0A      + assignable_scopes           = (known after apply)%0A      + description                 = "Custom storage role definition"%0A      + id                          = (known after apply)%0A      + name                        = "CustomStoragetfStateRole"%0A      + role_definition_id          = (known after apply)%0A      + role_definition_resource_id = (known after apply)%0A      + scope                       = "/subscriptions/0a9f0f70-125d-472b-9608-1dc91377b039/resourceGroups/eastus-jagadishtf/providers/Microsoft.Storage/storageAccounts/jagadishrunbookstfstate"%0A%0A      + permissions {%0A          + actions     = [%0A              + "Microsoft.Storage/storageAccounts/listKeys/action",%0A              + "Microsoft.Storage/storageAccounts/regeneratekey/action",%0A              + "Microsoft.Storage/storageAccounts/blobServices/generateUserDelegationKey/action",%0A            ]%0A          + not_actions = []%0A        }%0A    }%0A%0A  # azurerm_storage_account.jagadishrunbookstfstate will be created%0A  + resource "azurerm_storage_account" "jagadishrunbookstfstate" {%0A      + access_tier                       = (known after apply)%0A      + account_kind                      = "StorageV2"%0A      + account_replication_type          = "LRS"%0A      + account_tier                      = "Standard"%0A      + allow_nested_items_to_be_public   = false%0A      + cross_tenant_replication_enabled  = true%0A      + default_to_oauth_authentication   = false%0A      + enable_https_traffic_only         = true%0A      + id                                = (known after apply)%0A      + infrastructure_encryption_enabled = false%0A      + is_hns_enabled                    = false%0A      + large_file_share_enabled          = (known after apply)%0A      + location                          = "eastus"%0A      + min_tls_version                   = "TLS1_2"%0A      + name                              = "jagadishrunbookstfstate"%0A      + nfsv3_enabled                     = false%0A      + primary_access_key                = (sensitive value)%0A      + primary_blob_connection_string    = (sensitive value)%0A      + primary_blob_endpoint             = (known after apply)%0A      + primary_blob_host                 = (known after apply)%0A      + primary_connection_string         = (sensitive value)%0A      + primary_dfs_endpoint              = (known after apply)%0A      + primary_dfs_host                  = (known after apply)%0A      + primary_file_endpoint             = (known after apply)%0A      + primary_file_host                 = (known after apply)%0A      + primary_location                  = (known after apply)%0A      + primary_queue_endpoint            = (known after apply)%0A      + primary_queue_host                = (known after apply)%0A      + primary_table_endpoint            = (known after apply)%0A      + primary_table_host                = (known after apply)%0A      + primary_web_endpoint              = (known after apply)%0A      + primary_web_host                  = (known after apply)%0A      + public_network_access_enabled     = true%0A      + queue_encryption_key_type         = "Service"%0A      + resource_group_name               = "eastus-jagadishtf"%0A      + secondary_access_key              = (sensitive value)%0A      + secondary_blob_connection_string  = (sensitive value)%0A      + secondary_blob_endpoint           = (known after apply)%0A      + secondary_blob_host               = (known after apply)%0A      + secondary_connection_string       = (sensitive value)%0A      + secondary_dfs_endpoint            = (known after apply)%0A      + secondary_dfs_host                = (known after apply)%0A      + secondary_file_endpoint           = (known after apply)%0A      + secondary_file_host               = (known after apply)%0A      + secondary_location                = (known after apply)%0A      + secondary_queue_endpoint          = (known after apply)%0A      + secondary_queue_host              = (known after apply)%0A      + secondary_table_endpoint          = (known after apply)%0A      + secondary_table_host              = (known after apply)%0A      + secondary_web_endpoint            = (known after apply)%0A      + secondary_web_host                = (known after apply)%0A      + sftp_enabled                      = false%0A      + shared_access_key_enabled         = true%0A      + table_encryption_key_type         = "Service"%0A      + tags                              = {%0A          + "environment" = "dev"%0A        }%0A    }%0A%0A  # azurerm_storage_container.jagadishrunbookstf will be created%0A  + resource "azurerm_storage_container" "jagadishrunbookstf" {%0A      + container_access_type   = "blob"%0A      + has_immutability_policy = (known after apply)%0A      + has_legal_hold          = (known after apply)%0A      + id                      = (known after apply)%0A      + metadata                = (known after apply)%0A      + name                    = "jagadishrunbookstf"%0A      + resource_manager_id     = (known after apply)%0A      + storage_account_name    = "jagadishrunbookstfstate"%0A    }%0A%0A  # random_uuid.gh-actions-runbooks-id will be created%0A  + resource "random_uuid" "gh-actions-runbooks-id" {%0A      + id     = (known after apply)%0A      + result = (known after apply)%0A    }%0A%0APlan: 10 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + app_id               = (known after apply)%0A  + auth_client_secret   = (sensitive value)%0A  + sas_url_query_string = (sensitive value)%0A  + sub_id               = "0a9f0f70-125d-472b-9608-1dc91377b039"%0A  + tenant_id            = "51cb18b8-659b-4921-a8f8-5299e1fa51ed"%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # data.azurerm_storage_account_sas.jagadishrunbookstfstate will be read during apply%0A  # (config refers to values not yet known)%0A <= data "azurerm_storage_account_sas" "jagadishrunbookstfstate" {%0A      + connection_string = (sensitive value)%0A      + expiry            = "2023-12-31T00:00:00Z"%0A      + https_only        = true%0A      + id                = (known after apply)%0A      + sas               = (sensitive value)%0A      + signed_version    = "2017-07-29"%0A      + start             = "2022-08-28T00:00:00Z"%0A%0A      + permissions {%0A          + add     = true%0A          + create  = true%0A          + delete  = false%0A          + filter  = false%0A          + list    = false%0A          + process = false%0A          + read    = true%0A          + tag     = false%0A          + update  = false%0A          + write   = true%0A        }%0A%0A      + resource_types {%0A          + container = false%0A          + object    = false%0A          + service   = true%0A        }%0A%0A      + services {%0A          + blob  = true%0A          + file  = false%0A          + queue = false%0A          + table = false%0A        }%0A    }%0A%0A  # azuread_application.gh-actions-runbooks-ad will be created%0A  + resource "azuread_application" "gh-actions-runbooks-ad" {%0A      + app_role_ids                = (known after apply)%0A      + application_id              = (known after apply)%0A      + disabled_by_microsoft       = (known after apply)%0A      + display_name                = "gh-actions-runbooks-ad"%0A      + id                          = (known after apply)%0A      + logo_url                    = (known after apply)%0A      + oauth2_permission_scope_ids = (known after apply)%0A      + object_id                   = (known after apply)%0A      + owners                      = [%0A          + "0173bcb9-cc16-4636-aae5-54aa7fb096f0",%0A        ]%0A      + prevent_duplicate_names     = false%0A      + publisher_domain            = (known after apply)%0A      + sign_in_audience            = "AzureADMyOrg"%0A      + tags                        = (known after apply)%0A      + template_id                 = (known after apply)%0A%0A      + api {%0A          + mapped_claims_enabled          = true%0A          + requested_access_token_version = 2%0A%0A          + oauth2_permission_scope {%0A              + admin_consent_description  = "Allow the application to access GH Actions on behalf of the signed-in user."%0A              + admin_consent_display_name = "Access GH Actions"%0A              + enabled                    = true%0A              + id                         = (known after apply)%0A              + type                       = "User"%0A              + user_consent_description   = "Allow the application to access GH Actions on your behalf."%0A              + user_consent_display_name  = "Access GH Actions"%0A              + value                      = "user_impersonation"%0A            }%0A        }%0A%0A      + required_resource_access {%0A          + resource_app_id = "00000003-0000-0000-c000-000000000000"%0A%0A          + resource_access {%0A              + id   = "df021288-bdef-4463-88db-98f22de89214"%0A              + type = "Role"%0A            }%0A          + resource_access {%0A              + id   = "5b567255-7703-4780-807c-7be8301ae99b"%0A              + type = "Role"%0A            }%0A          + resource_access {%0A              + id   = "dbb9058a-0e50-45d7-ae91-66909b5d4664"%0A              + type = "Role"%0A            }%0A          + resource_access {%0A              + id   = "9a5d68dd-52b0-4cc2-bd40-abcf44ac3a30"%0A              + type = "Role"%0A            }%0A          + resource_access {%0A              + id   = "19dbc75e-c2e2-444c-a770-ec69d8559fc7"%0A              + type = "Role"%0A            }%0A          + resource_access {%0A              + id   = "246dd0d5-5bd0-4def-940b-0421030a5b68"%0A              + type = "Role"%0A            }%0A          + resource_access {%0A              + id   = "01c0a623-fc9b-48e9-b794-0756f8e8f067"%0A              + type = "Role"%0A            }%0A        }%0A%0A      + web {%0A          + implicit_grant {%0A              + access_token_issuance_enabled = false%0A              + id_token_issuance_enabled     = true%0A            }%0A        }%0A    }%0A%0A  # azuread_service_principal.gh-actions-runbooks-ad will be created%0A  + resource "azuread_service_principal" "gh-actions-runbooks-ad" {%0A      + account_enabled             = true%0A      + app_role_ids                = (known after apply)%0A      + app_roles                   = (known after apply)%0A      + application_id              = (known after apply)%0A      + application_tenant_id       = (known after apply)%0A      + display_name                = (known after apply)%0A      + homepage_url                = (known after apply)%0A      + id                          = (known after apply)%0A      + logout_url                  = (known after apply)%0A      + oauth2_permission_scope_ids = (known after apply)%0A      + oauth2_permission_scopes    = (known after apply)%0A      + object_id                   = (known after apply)%0A      + redirect_uris               = (known after apply)%0A      + saml_metadata_url           = (known after apply)%0A      + service_principal_names     = (known after apply)%0A      + sign_in_audience            = (known after apply)%0A      + tags                        = (known after apply)%0A      + type                        = (known after apply)%0A    }%0A%0A  # azuread_service_principal_password.gh-actions-runbooks-ad will be created%0A  + resource "azuread_service_principal_password" "gh-actions-runbooks-ad" {%0A      + display_name         = (known after apply)%0A      + end_date             = (known after apply)%0A      + id                   = (known after apply)%0A      + key_id               = (known after apply)%0A      + service_principal_id = (known after apply)%0A      + start_date           = (known after apply)%0A      + value                = (sensitive value)%0A    }%0A%0A  # azurerm_resource_group.eastus-jagadishtf will be created%0A  + resource "azurerm_resource_group" "eastus-jagadishtf" {%0A      + id       = (known after apply)%0A      + location = "eastus"%0A      + name     = "eastus-jagadishtf"%0A    }%0A%0A  # azurerm_role_assignment.Custom_storage_tfstate_role will be created%0A  + resource "azurerm_role_assignment" "Custom_storage_tfstate_role" {%0A      + description                      = "Custom storage role for managing tf state blob"%0A      + id                               = (known after apply)%0A      + name                             = (known after apply)%0A      + principal_id                     = (known after apply)%0A      + principal_type                   = (known after apply)%0A      + role_definition_id               = (known after apply)%0A      + role_definition_name             = (known after apply)%0A      + scope                            = "/subscriptions/0a9f0f70-125d-472b-9608-1dc91377b039/resourceGroups/eastus-jagadishtf/providers/Microsoft.Storage/storageAccounts/jagadishrunbookstfstate"%0A      + skip_service_principal_aad_check = (known after apply)%0A    }%0A%0A  # azurerm_role_assignment.gh-actions-runbooks-ad-reader will be created%0A  + resource "azurerm_role_assignment" "gh-actions-runbooks-ad-reader" {%0A      + id                               = (known after apply)%0A      + name                             = (known after apply)%0A      + principal_id                     = (known after apply)%0A      + principal_type                   = (known after apply)%0A      + role_definition_id               = (known after apply)%0A      + role_definition_name             = "Reader"%0A      + scope                            = "/subscriptions/0a9f0f70-125d-472b-9608-1dc91377b039"%0A      + skip_service_principal_aad_check = (known after apply)%0A    }%0A%0A  # azurerm_role_definition.Custom_storage_tfstate_role_def will be created%0A  + resource "azurerm_role_definition" "Custom_storage_tfstate_role_def" {%0A      + assignable_scopes           = (known after apply)%0A      + description                 = "Custom storage role definition"%0A      + id                          = (known after apply)%0A      + name                        = "CustomStoragetfStateRole"%0A      + role_definition_id          = (known after apply)%0A      + role_definition_resource_id = (known after apply)%0A      + scope                       = "/subscriptions/0a9f0f70-125d-472b-9608-1dc91377b039/resourceGroups/eastus-jagadishtf/providers/Microsoft.Storage/storageAccounts/jagadishrunbookstfstate"%0A%0A      + permissions {%0A          + actions     = [%0A              + "Microsoft.Storage/storageAccounts/listKeys/action",%0A              + "Microsoft.Storage/storageAccounts/regeneratekey/action",%0A              + "Microsoft.Storage/storageAccounts/blobServices/generateUserDelegationKey/action",%0A            ]%0A          + not_actions = []%0A        }%0A    }%0A%0A  # azurerm_storage_account.jagadishrunbookstfstate will be created%0A  + resource "azurerm_storage_account" "jagadishrunbookstfstate" {%0A      + access_tier                       = (known after apply)%0A      + account_kind                      = "StorageV2"%0A      + account_replication_type          = "LRS"%0A      + account_tier                      = "Standard"%0A      + allow_nested_items_to_be_public   = false%0A      + cross_tenant_replication_enabled  = true%0A      + default_to_oauth_authentication   = false%0A      + enable_https_traffic_only         = true%0A      + id                                = (known after apply)%0A      + infrastructure_encryption_enabled = false%0A      + is_hns_enabled                    = false%0A      + large_file_share_enabled          = (known after apply)%0A      + location                          = "eastus"%0A      + min_tls_version                   = "TLS1_2"%0A      + name                              = "jagadishrunbookstfstate"%0A      + nfsv3_enabled                     = false%0A      + primary_access_key                = (sensitive value)%0A      + primary_blob_connection_string    = (sensitive value)%0A      + primary_blob_endpoint             = (known after apply)%0A      + primary_blob_host                 = (known after apply)%0A      + primary_connection_string         = (sensitive value)%0A      + primary_dfs_endpoint              = (known after apply)%0A      + primary_dfs_host                  = (known after apply)%0A      + primary_file_endpoint             = (known after apply)%0A      + primary_file_host                 = (known after apply)%0A      + primary_location                  = (known after apply)%0A      + primary_queue_endpoint            = (known after apply)%0A      + primary_queue_host                = (known after apply)%0A      + primary_table_endpoint            = (known after apply)%0A      + primary_table_host                = (known after apply)%0A      + primary_web_endpoint              = (known after apply)%0A      + primary_web_host                  = (known after apply)%0A      + public_network_access_enabled     = true%0A      + queue_encryption_key_type         = "Service"%0A      + resource_group_name               = "eastus-jagadishtf"%0A      + secondary_access_key              = (sensitive value)%0A      + secondary_blob_connection_string  = (sensitive value)%0A      + secondary_blob_endpoint           = (known after apply)%0A      + secondary_blob_host               = (known after apply)%0A      + secondary_connection_string       = (sensitive value)%0A      + secondary_dfs_endpoint            = (known after apply)%0A      + secondary_dfs_host                = (known after apply)%0A      + secondary_file_endpoint           = (known after apply)%0A      + secondary_file_host               = (known after apply)%0A      + secondary_location                = (known after apply)%0A      + secondary_queue_endpoint          = (known after apply)%0A      + secondary_queue_host              = (known after apply)%0A      + secondary_table_endpoint          = (known after apply)%0A      + secondary_table_host              = (known after apply)%0A      + secondary_web_endpoint            = (known after apply)%0A      + secondary_web_host                = (known after apply)%0A      + sftp_enabled                      = false%0A      + shared_access_key_enabled         = true%0A      + table_encryption_key_type         = "Service"%0A      + tags                              = {%0A          + "environment" = "dev"%0A        }%0A    }%0A%0A  # azurerm_storage_container.jagadishrunbookstf will be created%0A  + resource "azurerm_storage_container" "jagadishrunbookstf" {%0A      + container_access_type   = "blob"%0A      + has_immutability_policy = (known after apply)%0A      + has_legal_hold          = (known after apply)%0A      + id                      = (known after apply)%0A      + metadata                = (known after apply)%0A      + name                    = "jagadishrunbookstf"%0A      + resource_manager_id     = (known after apply)%0A      + storage_account_name    = "jagadishrunbookstfstate"%0A    }%0A%0A  # random_uuid.gh-actions-runbooks-id will be created%0A  + resource "random_uuid" "gh-actions-runbooks-id" {%0A      + id     = (known after apply)%0A      + result = (known after apply)%0A    }%0A%0APlan: 10 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + app_id               = (known after apply)%0A  + auth_client_secret   = (sensitive value)%0A  + sas_url_query_string = (sensitive value)%0A  + sub_id               = "0a9f0f70-125d-472b-9608-1dc91377b039"%0A  + tenant_id            = "51cb18b8-659b-4921-a8f8-5299e1fa51ed"%0A

::set-output name=stderr::

::set-output name=exitcode::0
```

</details>

*Pushed by: @jvemugunta, Action: `pull_request`*